#   -*- mode: org; fill-column: 60 -*-
#+TITLE: Install ircd Hybrid 
#+STARTUP: showall
#+PROPERTY: filename 
  :PROPERTIES:
  :Name: /home/deerpig/proj/deerpig/deerpig-install/rb-ircd-install.org
  :Created: 2016-09-01T14:00@Wat Phnom (11.5733N17-104.925295W)
  :ID: 4b1f5459-c661-45ef-b8b3-00b4d2244f8f
  :URL:
  :END:
#+INCLUDE: ./inc/head.org
#+INCLUDE: ./inc/macros.org

{{{breadcrumbs}}}

#+HTML: <div class="outline-2" id="meta">
| *Author*  | Brad Collins <brad@chenla.org>             |
| *Date*    | {{{time(%Y-%m-%d %H:%M:%S)}}}              |
#+HTML: </div>

#+TOC: headlines 4

* Status of This Document

The latest version of this document is: src_sh[:results value]{git describe --abbrev=0 --tags}

#+HTML: <div class="notice notice-info">
*Changes since the last version*

#+HTML: <ul>

#+BEGIN_SRC sh :exports results :results value html :var TAG="v00.01.02"
  RES=`git log $TAG...HEAD --pretty="<li>%s</li>\n" -- rb-ircd-install.org`
  if [ -z $RES ]; then
    RES="<li>no changes</li>"
  fi
  echo $RES
#+END_SRC

#+RESULTS:
#+BEGIN_EXPORT html
<li>no changes</li>
#+END_EXPORT

#+HTML: </ul>
#+HTML: </div>

* Introduction

This runbook describes how to install ircd-Hybrid and Anope
IRC services.

This assumes that the install is being made on a clean
instance of Debian Server 8.5 Jessie.

* Install dependencies

#+begin_src sh
sudo apt-get install build-essential cmake openssl libssl-dev
#+end_src

* Install ircd-hybrid

#+begin_src sh
sudo apt-get install ircd-hybrid
#+end_src

Use mkpasswd to generate an encrypted password for the
configuration files. The password is used by the
administrator to gain operator privileges and by hybserv to
add bots.

#+begin_src sh
mkpasswd <newpassword>
0HB28ImENQ7mc
#+end_src

Open the IRC server configuration and adjust to suit your
needs. The following contains the minimum configuration
required:

#+begin_src sh
sudo emacs /etc/ircd-hybrid/ircd.conf
#+end_src

